mistyrain83/cc3200app/user/common/gpio_if.c
//*****************************************************************************
// gpio_if.c
//
// GPIO interface APIs, this common interface file helps to configure,
// set/toggle only 2 GPIO pins which are connected to 2 LEDs of backplane
//
// All LED Pull-Up, turn on LED when pin output low level
//
//*****************************************************************************

// Standard includes
#include <stdio.h>

// Driverlib includes
#include "hw_types.h"
#include "hw_ints.h"
#include "hw_memmap.h"
#include "hw_apps_rcm.h"
#include "interrupt.h"
#include "pin.h"
#include "gpio.h"
#include "prcm.h"
#include "rom.h"
#include "rom_map.h"

// OS includes
#ifdef USE_TIRTOS
#include <stdlib.h>
#include "osi.h"
#endif

// Common interface include
#include "gpio_if.h"

//****************************************************************************
//                      GLOBAL VARIABLES                                   
//****************************************************************************
static unsigned long ulReg[]=
{
    GPIOA0_BASE,
    GPIOA1_BASE,
    GPIOA2_BASE,
    GPIOA3_BASE,
    GPIOA4_BASE
};

//*****************************************************************************
// Variables to store TIMER Port,Pin values
//*****************************************************************************
unsigned int g_uiLED1Port = 3,g_uiLED2Port = 0;
unsigned char g_ucLED1Pin,g_ucLED2Pin;

unsigned int g_uiDO1Port = 0,g_uiDO2Port = 0,g_uiDO3Port = 0,g_uiDO4Port = 0;
unsigned char g_ucDO1Pin,g_ucDO2Pin,g_ucDO3Pin,g_ucDO4Pin;

#define PIN_LED1 0
#define PIN_LED2 30

#define PIN_DO1 7
#define PIN_DO2 9
#define PIN_DO3 6
#define PIN_DO4 4

//****************************************************************************
//                      LOCAL FUNCTION DEFINITIONS                          
//****************************************************************************
#ifdef USE_TIRTOS
static unsigned char
GetPeripheralIntNum(unsigned int uiGPIOPort)
{

    switch(uiGPIOPort)
    {
       case GPIOA0_BASE:
          return INT_GPIOA0;
       case GPIOA1_BASE:
          return INT_GPIOA1;
       case GPIOA2_BASE:
          return INT_GPIOA2;
       case GPIOA3_BASE:
          return INT_GPIOA3;
       default:
          return INT_GPIOA0;
    }

}
#endif

//*****************************************************************************
//
//! GPIO Enable & Configuration
//!
//! \param  ucPins is the bit-pack representation of 3 LEDs
//!         LSB:GP09-GP10-GP11:MSB
//!
//! \return None
//
//*****************************************************************************
void
GPIO_IF_LedConfigure(unsigned char ucPins)
{

  if(ucPins & LED1)
  {
    GPIO_IF_GetPortNPin(PIN_LED1,
                        &g_uiLED1Port,
                        &g_ucLED1Pin);
  }

  if(ucPins & LED2)
  {
    GPIO_IF_GetPortNPin(PIN_LED2,
                  		&g_uiLED2Port,
          				&g_ucLED2Pin);
  }

}

void
GPIO_IF_DOConfigure(unsigned char ucPins)
{
  if(ucPins & DO1)
  {
    GPIO_IF_GetPortNPin(PIN_DO1,
                        &g_uiDO1Port,
                        &g_ucDO1Pin);
  }

  if(ucPins & DO2)
  {
  GPIO_IF_GetPortNPin(PIN_DO2,
                        &g_uiDO2Port,
                        &g_ucDO2Pin);
  }

  if(ucPins & DO3)
  {
   GPIO_IF_GetPortNPin(PIN_DO3,
                        &g_uiDO3Port,
                        &g_ucDO3Pin);
  }

  if(ucPins & DO4)
  {
  GPIO_IF_GetPortNPin(PIN_DO4,
                        &g_uiDO4Port,
                        &g_ucDO4Pin);
  }

}

//*****************************************************************************
//
//! Turn LED On
//!
//! \param  ledNum is the LED Number
//!
//! \return none
//!
//! \brief  Turns a specific LED Off
//
//*****************************************************************************
void
GPIO_IF_LedOn(char ledNum)
{
    switch(ledNum)
    {
        case MCU_ON_IND:
        case MCU_EXECUTE_SUCCESS_IND:
		case MCU_SENDING_DATA_IND:
        case MCU_EXECUTE_FAIL_IND:
        case MCU_GREEN_LED_GPIO:
        {
          /* Switch ON GREEN LED */
          GPIO_IF_Set(PIN_LED2, g_uiLED2Port, g_ucLED2Pin, 0);
          break;
        }
        
        case MCU_ASSOCIATED_IND:
        case MCU_IP_ALLOC_IND:
        case MCU_SERVER_INIT_IND:
        case MCU_CLIENT_CONNECTED_IND:
        case MCU_RED_LED_GPIO:
        {
          /* Switch ON RED LED */
          GPIO_IF_Set(PIN_LED1, g_uiLED1Port, g_ucLED1Pin, 0);
          break;
        }
		
        case MCU_ALL_LED_IND:
        {
          /* Switch ON ALL LEDs LED */
          GPIO_IF_Set(PIN_LED2, g_uiLED2Port, g_ucLED2Pin, 0);
          GPIO_IF_Set(PIN_LED1, g_uiLED1Port, g_ucLED1Pin, 0);
          break;
        }
        default:
          break;
    }
}

void
GPIO_IF_DOOn(char doNum)
{
  switch(doNum)
  {
    case MCU_DO1_IND:
    {
      GPIO_IF_Set(PIN_DO1, g_uiDO1Port, g_ucDO1Pin, 1);
      break;
    }
	case MCU_DO2_IND:
    {
      GPIO_IF_Set(PIN_DO2, g_uiDO2Port, g_ucDO2Pin, 1);
      break;
    }
	case MCU_DO3_IND:
    {
      GPIO_IF_Set(PIN_DO3, g_uiDO3Port, g_ucDO3Pin, 1);
      break;
    }
	case MCU_DO4_IND:
    {
      GPIO_IF_Set(PIN_DO4, g_uiDO4Port, g_ucDO4Pin, 1);
      break;
    }
    default:
      break;
  }
}

//*****************************************************************************
//
//! Turn LED Off
//!
//! \param  ledNum is the LED Number
//!
//! \return none
//!
//! \brief  Turns a specific LED Off
//
//*****************************************************************************
void
GPIO_IF_LedOff(char ledNum)
{
  switch(ledNum)
  {
    case MCU_ON_IND:
    case MCU_EXECUTE_SUCCESS_IND:
	case MCU_SENDING_DATA_IND:
    case MCU_EXECUTE_FAIL_IND:
    case MCU_GREEN_LED_GPIO:
    {
      /* Switch OFF GREEN LED */
      GPIO_IF_Set(PIN_LED2, g_uiLED2Port, g_ucLED2Pin, 1);
      break;
    }
    
    case MCU_ASSOCIATED_IND:
    case MCU_IP_ALLOC_IND:
    case MCU_SERVER_INIT_IND:
    case MCU_CLIENT_CONNECTED_IND:
    case MCU_RED_LED_GPIO:
    {
      /* Switch OFF RED LED */
      GPIO_IF_Set(PIN_LED1, g_uiLED1Port, g_ucLED1Pin, 1);
      break;
    }
	
    case MCU_ALL_LED_IND:
    {
      /* Switch OFF ALL LEDs LED */
      GPIO_IF_Set(PIN_LED2, g_uiLED2Port, g_ucLED2Pin, 1);
      GPIO_IF_Set(PIN_LED1, g_uiLED1Port, g_ucLED1Pin, 1);
      break;
    }
    default:
      break;
  }
}

void
GPIO_IF_DOOff(char doNum)
{
  switch(doNum)
  {
    case MCU_DO1_IND:
    {
      GPIO_IF_Set(PIN_DO1, g_uiDO1Port, g_ucDO1Pin, 0);
      break;
    }
	case MCU_DO2_IND:
    {
      GPIO_IF_Set(PIN_DO2, g_uiDO2Port, g_ucDO2Pin, 0);
      break;
    }
	case MCU_DO3_IND:
    {
      GPIO_IF_Set(PIN_DO3, g_uiDO3Port, g_ucDO3Pin, 0);
      break;
    }
	case MCU_DO4_IND:
    {
      GPIO_IF_Set(PIN_DO4, g_uiDO4Port, g_ucDO4Pin, 0);
      break;
    }
    default:
      break;
  }
}

//*****************************************************************************
//
//!  \brief This function returns LED current Status
//!
//!  \param[in] ucGPIONum is the GPIO to which the LED is connected
//!                MCU_GREEN_LED_GPIO\MCU_ORANGE_LED_GPIO\MCU_RED_LED_GPIO
//!
//!
//!  \return 1: LED ON, 0: LED OFF
//
//*****************************************************************************
unsigned char
GPIO_IF_LedStatus(unsigned char ucGPIONum)
{
  unsigned char ucLEDStatus;
  switch(ucGPIONum)
  {
    case MCU_GREEN_LED_GPIO:
    {
      ucLEDStatus = GPIO_IF_Get(ucGPIONum, g_uiLED2Port, g_ucLED2Pin);
      break;
    }
    case MCU_RED_LED_GPIO:
    {
      ucLEDStatus = GPIO_IF_Get(ucGPIONum, g_uiLED1Port, g_ucLED1Pin);
      break;
    }
    default:
        ucLEDStatus = 0;
  }
  return ucLEDStatus;
}

unsigned char
GPIO_IF_DOStatus(unsigned char ucGPIONum)
{
  unsigned char ucDOStatus;
  switch(ucGPIONum)
  {
    case MCU_DO1_IND:
    {
      ucDOStatus = GPIO_IF_Get(ucGPIONum, g_uiDO1Port, g_ucDO1Pin);
      break;
    }
    case MCU_DO2_IND:
    {
      ucDOStatus = GPIO_IF_Get(ucGPIONum, g_uiDO2Port, g_ucDO2Pin);
      break;
    }
	case MCU_DO3_IND:
    {
      ucDOStatus = GPIO_IF_Get(ucGPIONum, g_uiDO3Port, g_ucDO3Pin);
      break;
    }
	case MCU_DO4_IND:
    {
      ucDOStatus = GPIO_IF_Get(ucGPIONum, g_uiDO4Port, g_ucDO4Pin);
      break;
    }
    default:
        ucDOStatus = 0;
  }
  return ucDOStatus;
}

//*****************************************************************************
//
//! Toggle the Led state
//!
//! \param  ledNum is the LED Number
//!
//! \return none
//!
//! \brief  Toggles a board LED
//
//*****************************************************************************
void GPIO_IF_LedToggle(unsigned char ucLedNum)
{

    unsigned char ucLEDStatus = GPIO_IF_LedStatus(ucLedNum);
    if(ucLEDStatus == 1)
    {
        GPIO_IF_LedOff(ucLedNum);
    }
    else
    {
        GPIO_IF_LedOn(ucLedNum);
    }
}

void GPIO_IF_DOToggle(unsigned char ucDONum)
{

    unsigned char ucDOStatus = GPIO_IF_DOStatus(ucDONum);
    if(ucDOStatus == 1)
    {
        GPIO_IF_LedOff(ucDONum);
    }
    else
    {
        GPIO_IF_LedOn(ucDONum);
    }
}

//****************************************************************************
//
//! Get the port and pin of a given GPIO
//!
//! \param ucPin is the pin to be set-up as a GPIO (0:39)
//! \param puiGPIOPort is the pointer to store GPIO port address return value
//! \param pucGPIOPin is the pointer to store GPIO pin return value
//! 
//! This function  
//!    1. Return the GPIO port address and pin for a given external pin number
//!
//! \return None.
//
//****************************************************************************
void
GPIO_IF_GetPortNPin(unsigned char ucPin,
                unsigned int *puiGPIOPort,
                    unsigned char *pucGPIOPin)
{
    //
    // Get the GPIO pin from the external Pin number
    //
    *pucGPIOPin = 1 << (ucPin % 8);

    //
    // Get the GPIO port from the external Pin number
    //
    *puiGPIOPort = (ucPin / 8);
    *puiGPIOPort = ulReg[*puiGPIOPort];
}

//****************************************************************************
//
//! Configures the GPIO selected as input to generate interrupt on activity
//!
//! \param uiGPIOPort is the GPIO port address
//! \param ucGPIOPin is the GPIO pin of the specified port
//! \param uiIntType is the type of the interrupt (refer gpio.h)
//! \param pfnIntHandler is the interrupt handler to register
//! 
//! This function  
//!    1. Sets GPIO interrupt type
//!    2. Registers Interrupt handler
//!    3. Enables Interrupt
//!
//! \return None
//
//****************************************************************************
void
GPIO_IF_ConfigureNIntEnable(unsigned int uiGPIOPort,
                                  unsigned char ucGPIOPin,
                                  unsigned int uiIntType,
                                  void (*pfnIntHandler)(void))
{
    //
    // Set GPIO interrupt type
    //
    MAP_GPIOIntTypeSet(uiGPIOPort,ucGPIOPin,uiIntType);

    //
    // Register Interrupt handler
    //
#ifdef USE_TIRTOS
    osi_InterruptRegister(GetPeripheralIntNum(uiGPIOPort),
                                        pfnIntHandler, INT_PRIORITY_LVL_1);
                
#else
    MAP_GPIOIntRegister(uiGPIOPort,pfnIntHandler);
#endif

    //
    // Enable Interrupt
    //
    MAP_GPIOIntClear(uiGPIOPort,ucGPIOPin);
    MAP_GPIOIntEnable(uiGPIOPort,ucGPIOPin);
}

//****************************************************************************
//
//! Set a value to the specified GPIO pin
//!
//! \param ucPin is the GPIO pin to be set (0:39)
//! \param uiGPIOPort is the GPIO port address
//! \param ucGPIOPin is the GPIO pin of the specified port
//! \param ucGPIOValue is the value to be set
//! 
//! This function  
//!    1. Sets a value to the specified GPIO pin
//!
//! \return None.
//
//****************************************************************************
void 
GPIO_IF_Set(unsigned char ucPin,
             unsigned int uiGPIOPort,
             unsigned char ucGPIOPin,
             unsigned char ucGPIOValue)
{
    //
    // Set the corresponding bit in the bitmask
    //
    ucGPIOValue = ucGPIOValue << (ucPin % 8);

    //
    // Invoke the API to set the value
    //
    MAP_GPIOPinWrite(uiGPIOPort,ucGPIOPin,ucGPIOValue);
}

//****************************************************************************
//
//! Set a value to the specified GPIO pin
//!
//! \param ucPin is the GPIO pin to be set (0:39)
//! \param uiGPIOPort is the GPIO port address
//! \param ucGPIOPin is the GPIO pin of the specified port
//!
//! This function
//!    1. Gets a value of the specified GPIO pin
//!
//! \return value of the GPIO pin
//
//****************************************************************************
unsigned char
GPIO_IF_Get(unsigned char ucPin,
             unsigned int uiGPIOPort,
             unsigned char ucGPIOPin)
{
    unsigned char ucGPIOValue;
    long lGPIOStatus;

    //
    // Invoke the API to Get the value
    //
    lGPIOStatus =  MAP_GPIOPinRead(uiGPIOPort,ucGPIOPin);

    //
    // Set the corresponding bit in the bitmask
    //
    ucGPIOValue = lGPIOStatus >> (ucPin % 8);
    return ucGPIOValue;
}

//*****************************************************************************
//
// Close the Doxygen group.
//! @}
//
//*****************************************************************************
